app/Helpers/Helper.php

select `vendor_id`, `overall_rating`, `communication_rating`, `ontime_delivery_rating`, `sample_support_rating`, `product_quality_rating`, `experience`, `name`, `state`, `image` from `product_reviews` inner join `users` on `product_reviews`.`created_by` = `users`.`id` where `product_id` = 384
---
    function singleProductReviewInformation($product_id)
    {
        //$productReview = ProductReview::where('product_id', $product_id)->->get();
        $productReviews = DB::table('product_reviews')
                            ->join('users', 'product_reviews.created_by', '=', 'users.id')
                            ->where('product_id', $product_id)
                            ->get(['vendor_id', 'overall_rating', 'communication_rating', 'ontime_delivery_rating', 'sample_support_rating', 'product_quality_rating', 'experience', 'name','state', 'image']);

select `related_product_id` from `related_products` where `product_id` = 384 and `related_product_id` != 384 and `related_products`.`deleted_at` is null
---
    function relatedProductInformation($product_id)
    {
        $relatedProductId = RelatedProduct::where('product_id', $product_id)->where('related_product_id', '!=', $product_id)->pluck('related_product_id');

select `title`, `id` from `product_type_mappings` where `parent_id` = 1
---
    function productTypeMapping($parent_id){
        $product_type_mapping=ProductTypeMapping::where('parent_id',$parent_id)->pluck('title','id');