app/Http/Controllers/BusinessProfile/BusinessProfileController.php

    public function index($alias){
        $business_profile = BusinessProfile::withTrashed()->with('user')->where('alias',$alias)->firstOrFail();
---
select * from `business_profiles` where `alias` = 'radiant-sweaters-ind-ltd' limit 1
select * from `users` where `users`.`id` in (42) and `users`.`deleted_at` is null

    public function products($alias,Request $request){

        $business_profile=BusinessProfile::withTrashed()->where('alias',$alias)->firstOrFail();
        if((auth()->id() == $business_profile->user_id) || (auth()->id() == $business_profile->representative_user_id))
        {
            if($business_profile->profile_type == 'supplier' && $business_profile->business_type == 'manufacturer'){
                $collection=collect(Product::withTrashed()
                ->latest()
                ->with('product_images','product_video')
                ->where(function($query) use ($request, $business_profile){
                    $query->where('business_profile_id', $business_profile->id)->get();
                    if(isset($request->search)){
                        $query->where('title','like', '%'.$request->search.'%')->get();
                    }

                })
                ->get());

                $controller_max_moq=$collection->max('moq');
---
select * from `business_profiles` where `alias` = 'mb-studio' limit 1
select * from `ic_products` where `business_profile_id` = 2 and `ic_products`.`deleted_at` is null
select * from `ic_product_images` where `ic_product_images`.`product_id` in (29, 36, 37, 38, 39, 40, 141, 142, 143, 144, 167, 168, 169, 1172, 1173, 1174, 1175, 1176, 1177)
select * from `ic_product_videos` where `ic_product_videos`.`product_id` in (29, 36, 37, 38, 39, 40, 141, 142, 143, 144, 167, 168, 169, 1172, 1173, 1174, 1175, 1176, 1177)
select * from `ic_products` where (`business_profile_id` = 2) order by `created_at` desc


            if($business_profile->profile_type == 'supplier' && $business_profile->business_type == 'wholesaler'){

                $collection=collect(WholesalerProduct::withTrashed()
                ->where(function($query) use ($request, $business_profile){
                    $query->where('business_profile_id', $business_profile->id)->get();
                    if(isset($request->search)){
                        $query->where('name','like', '%'.$request->search.'%')->get();
                    }})
                ->latest()
                ->with('images','video')
                ->get());
---
select * from `products` where (`business_profile_id` = 1) order by `created_at` desc