app/Http/Controllers/BusinessProfile/RfqController.php

    public function index($alias, Request $request)
    {
        $business_profile=BusinessProfile::where('alias',$alias)->firstOrFail();

        if((auth()->id() == $business_profile->user_id) || (auth()->id() == $business_profile->representative_user_id))
        {

            if($business_profile->business_type == 'manufacturer'){
                $collection=collect(ManufactureProduct::withTrashed()
                ->latest()
                ->with('product_images','product_video','businessProfile')
                ->where(function($query) use ($request, $business_profile){
                    $query->where('business_profile_id', '!=', null)->get();
                    if(isset($request->search)){
                        $query->where('title','like', '%'.$request->search.'%')->get();
                    }

                })
                ->get());
---
select * from `business_profiles` where `alias` = 'radiant-sweaters-ind-ltd' and `business_profiles`.`deleted_at` is null limit 1
select * from `ic_products` where `business_profile_id` is not null and `ic_products`.`deleted_at` is null
select * from `business_profiles` where `business_profiles`.`id` in (2, 7, 8, 9, 10, 11, 12, 13, 15, 3227, 3228, 3230, 3232, 3233, 3235, 3242, 3278, 3313, 3333, 3367, 3370, 3372, 3425, 3441, 3442, 3445, 3723, 3724, 3726, 3727, 3729, 3730, 3731, 3735, 3736, 3737, 3739, 3740, 3743, 3746, 3817, 3867, 3872, 3981, 4054, 4055, 4056, 4057, 4059, 4082, 4083, 4138, 4183, 4222, 4226, 4233, 4238, 4244, 4248, 4250, 4251, 4252, 4276, 4277, 4278, 4284, 4298, 4343, 4344, 4444, 4446, 4447, 4448, 4617, 5083, 5084, 5085, 5086, 5395, 5396, 5402, 5403, 5412, 5453, 5504, 5508, 5509, 5511, 5512, 5513, 5514, 5516, 5517, 5519, 5520, 5523, 5524, 5526, 5528, 5529, 5530, 5531, 5532, 5534, 5535, 5536, 5539, 5542, 5543, 5544, 5545, 5546, 5547, 5548, 5549, 5554, 5555, 5556, 5557, 5562, 5563, 5566, 5572, 5573, 5574, 5575, 5577, 5578, 5579, 5581, 5583, 5585, 5589, 5595, 5596, 5597, 5598, 5600, 5601, 5602, 5603, 5604, 5605, 5606, 5607, 5608, 5609, 5612, 5614, 5615, 5616, 5617, 5618, 5619, 5621, 5623, 5624, 5625, 5626, 5629, 5630, 5631, 5636, 5638, 5640, 5641, 5643, 5644, 5647, 5649, 5650, 5653, 5654, 5661, 5662, 5666, 5668, 5669, 5671, 5672, 5675, 5745, 5748, 5757, 5767, 5773) and `business_profiles`.`deleted_at` is null


            if($business_profile->business_type == 'wholesaler'){

                $collection=collect(WholesalerProduct::withTrashed()
                ->where(function($query) use ($request, $business_profile){
                    $query->where('business_profile_id', '!=', null)->get();
                    if(isset($request->search)){
                        $query->where('name','like', '%'.$request->search.'%')->get();
                    }})
                ->latest()
                ->with('images','video')
                ->get());
---
select * from `products` where (`business_profile_id` is not null) order by `created_at` desc

    public function myRfqList(Request $request, $alias)
    {
        $page = isset($request->page) ? $request->page : 1;
        $business_profile = BusinessProfile::with('user')->where('alias',$alias)->firstOrFail();
---
select * from `business_profiles` where `alias` = 'mb-studio' and `business_profiles`.`deleted_at` is null limit 1
select * from `users` where `users`.`id` in (42) and `users`.`deleted_at` is null

        ->get();

        if(env('APP_ENV') == 'local'){
            $adminUser = User::Find('5552');
---
select * from `users` where `users`.`id` = '5552' and `users`.`deleted_at` is null limit 1


        if(auth()->user())
        {
            $businessProfiles = BusinessProfile::withTrashed()->where('user_id',auth()->id())->get();
---
select * from `business_profiles` where `user_id` = 42