app/Http/Controllers/DesignersController.php

    public function designers(Request $request)
    {
        $users = User::with(['designers','designerPortfolio'])->where("user_type", "designer")->get();
---
select * from `designer_portfolio` where `designer_portfolio`.`user_id` in (6030, 6031, 6032, 6033)
select * from `users` where `user_type` = 'designer' and `users`.`deleted_at` is null