app/Http/Controllers/HomeController.php

select * from `product_images` where `product_images`.`product_id` in (53, 215, 273, 275, 284) and `product_images`.`deleted_at` is null
---
    public function mixProductDetails($flag, $id)
    {
        if($flag == 'mb'){
            $product = ManufactureProduct::with('product_images','businessProfile','product_video')->findOrFail($id);