app/Http/Controllers/HomeController.php

    public function index(Request $request)
    {
        $page = isset($request->page) ? $request->page : 1;

        $business_profile = BusinessProfile::with('user')->firstOrFail();
---
select * from `business_profiles` where `business_profiles`.`deleted_at` is null limit 1
select * from `users` where `users`.`id` in (42) and `users`.`deleted_at` is null

            ->get();

            if(env('APP_ENV') == 'local'){
                $adminUser = User::Find('5552');
---
select * from `users` where `users`.`id` = '5552' and `users`.`deleted_at` is null limit 1

    public function mixProductDetails($flag, $id)
    {
        if($flag == 'mb'){
            $product = ManufactureProduct::with('product_images','businessProfile','product_video')->findOrFail($id);
            $supplierCompanyInfo = BusinessProfile::with(['companyOverview', 'certifications'])->where('id', $product['businessProfile']->id)->first();
            //dd($supplierCompanyInfo);
            return view('product.manufactrue_product_details',compact('product', 'supplierCompanyInfo'));
        }
        else if($flag == 'shop'){

            $product = Product::with('businessProfile')->where('id',$id)->first();
            //$supplierCompanyInfo = CompanyOverview::where('business_profile_id', $product['businessProfile']->id)->first();
            $supplierCompanyInfo = BusinessProfile::with(['companyOverview', 'certifications'])->where('id', $product['businessProfile']->id)->first();
            //dd($supplierCompanyInfo->certifications);

            $orderModificationRequest=OrderModificationRequest::where(['product_id' => $product->id, 'type' => 2, 'user_id' =>auth()->id() ])->get();
            $productReviews = ProductReview::where('product_id',$product->id)->get();
---
select * from `business_profiles` where `business_profiles`.`id` in (2) and `business_profiles`.`deleted_at` is null
select * from `ic_product_images` where `ic_product_images`.`product_id` in (1177)
select * from `ic_product_videos` where `ic_product_videos`.`product_id` in (1177)
select * from `ic_products` where `ic_products`.`id` = '1177' and `ic_products`.`deleted_at` is null limit 1
select * from `business_profiles` where `business_profiles`.`id` in (1) and `business_profiles`.`deleted_at` is null
select * from `products` where `id` = '384' and `products`.`deleted_at` is null limit 1
select * from `order_modification_requests` where (`product_id` = 384 and `type` = 2 and `user_id` = 42)
select * from `product_reviews` where `product_id` = 384 and `product_reviews`.`deleted_at` is null


            $averageRating = $averageRating/5;

            $productReviewExistsOrNot = ProductReview::where('created_by',auth()->id())->where('product_id',$product->id)->first();
---
select * from `product_reviews` where `created_by` = 42 and `product_id` = 384 and `product_reviews`.`deleted_at` is null limit 1

        //         return false;

        //     });
        $recommandProducts=Product::where('state',1)
            ->where('id','!=',$product->id)
            ->where('product_type', $product->product_type)
            ->with(['images','businessProfile'])
            ->inRandomOrder()
            ->limit(5)
            ->get();

            if(Auth()->check()){
                $wishListShopProductsIds=ProductWishlist::where('user_id' , auth()->user()->id)->where('product_id', '!=', null)->pluck('product_id')->toArray();
                $wishListMfProductsIds=ProductWishlist::where('user_id' , auth()->user()->id)->where('manufacture_product_id', '!=', null)->pluck('manufacture_product_id')->toArray();
---
select * from `business_profiles` where `business_profiles`.`id` in (1, 5633) and `business_profiles`.`deleted_at` is null
select * from `products` where `state` = 1 and `id` != 384 and `product_type` = 1 and `products`.`deleted_at` is null order by RAND() limit 5
select `product_id` from `product_wishlists` where `user_id` = 42 and `product_id` is not null and `product_wishlists`.`deleted_at` is null
select `manufacture_product_id` from `product_wishlists` where `user_id` = 42 and `manufacture_product_id` is not null and `product_wishlists`.`deleted_at` is null

    public function productTypeMapping(Request $request, $type, $child)
    {
        switch($type) {
            case('studio'):
                $product_type_mapping_id=1;
                break;
            case('raw_materials'):
                $product_type_mapping_id=2;
                break;
            default:
                $product_type_mapping_id=null;
        }
        $user = auth()->user();

        $product_type_mapping_child_id=ProductTypeMapping::select('id')->where('title',$child)->first();

        if(empty($product_type_mapping_id) || empty($product_type_mapping_child_id)){
            abort(404);
        }

        $product_type_mapping_child_id =  $product_type_mapping_child_id->id;

        if($user && $user->is_request_verified == 1) // show all products for verified user.
        {
            $wholesaler_products=Product::with(['images','businessProfile'])->where('product_type_mapping_id', $product_type_mapping_id)->where(['state' => 1])->where('business_profile_id', '!=', null)->get();
            $manufacture_products=ManufactureProduct::with(['product_images','businessProfile'])->where('product_type_mapping_id', $product_type_mapping_id)->where('business_profile_id', '!=', null)->get();
---
select `id` from `product_type_mappings` where `title` = 'design' limit 1
select * from `products` where `product_type_mapping_id` = 1 and (`state` = 1) and `business_profile_id` is not null and `products`.`deleted_at` is null
select * from `business_profiles` where `business_profiles`.`id` in (2, 7, 8, 9, 10, 11, 12, 13, 15, 4183, 4222, 4226, 4238, 4248, 4343, 4344, 4448, 4617, 5504, 5508, 5511, 5512, 5513, 5514, 5516, 5517, 5519, 5520, 5523, 5524, 5526, 5529, 5530, 5531, 5532, 5534, 5535, 5536, 5539, 5542, 5543, 5544, 5545, 5546, 5547, 5548, 5549, 5554, 5555, 5556, 5562, 5566, 5573, 5578, 5581, 5583, 5585, 5589, 5595, 5596, 5598, 5600, 5601, 5602, 5603, 5604, 5605, 5606, 5607, 5608, 5609, 5612, 5614, 5615, 5616, 5617, 5618, 5623, 5625, 5626, 5629, 5630, 5631, 5636, 5638, 5641, 5643, 5644, 5661) and `business_profiles`.`deleted_at` is null
select * from `product_images` where `product_images`.`product_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 32, 33, 34, 35, 36, 37, 38, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 107, 108, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 153, 154, 176, 177, 178, 179, 180, 181, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195, 196, 197, 198, 199, 200, 201, 202, 203, 204, 205, 206, 207, 208, 209, 210, 211, 212, 213, 214, 215, 216, 217, 219, 220, 221, 222, 223, 225, 226, 227, 229, 230, 231, 233, 234, 236, 237, 239, 240, 242, 244, 245, 246, 247, 248, 249, 250, 251, 252, 253, 254, 255, 256, 257, 258, 259, 260, 261, 262, 264, 266, 267, 269, 271, 272, 274, 276, 277, 279, 286, 302, 303, 304, 306, 307, 308, 309, 310, 311, 312, 332, 333, 334, 335, 336, 337, 338, 339, 340, 341, 342, 343, 344, 345, 346, 347, 348, 349, 350, 351, 352, 353, 354, 355, 356, 357, 358, 359, 360, 361, 362, 363, 364, 365, 366, 367, 368, 369, 370, 371, 372, 373, 374, 375, 376, 377, 378, 379, 380, 381, 382, 383, 384, 385, 386, 387, 388) and `product_images`.`deleted_at` is null
select * from `ic_products` where `product_type_mapping_id` = 1 and `business_profile_id` is not null and `ic_products`.`deleted_at` is null

        );

        if(Auth()->check()){
            $wishListShopProductsIds=ProductWishlist::where('user_id' , auth()->user()->id)->where('product_id', '!=', null)->pluck('product_id')->toArray();
            $wishListMfProductsIds=ProductWishlist::where('user_id' , auth()->user()->id)->where('manufacture_product_id', '!=', null)->pluck('manufacture_product_id')->toArray();
---
select `product_id` from `product_wishlists` where `user_id` = 42 and `product_id` is not null and `product_wishlists`.`deleted_at` is null
select `manufacture_product_id` from `product_wishlists` where `user_id` = 42 and `manufacture_product_id` is not null and `product_wishlists`.`deleted_at` is null