app/Providers/ViewServiceProvider.php

select `id`, `name` from `product_tags`
select `id`, `title` from `product_type_mappings` where `parent_id` is not null
select * from `business_profiles` where `user_id` = 42
---
    public function boot()
    {

        //business profile for the auth user
        view()->composer('include._header', function($view) {
            if(auth()->check())
            {
                $businessProfiles = BusinessProfile::withTrashed()->where('user_id',auth()->id())->get();
                $view->with(['userBusinessProfiles' => $businessProfiles]);
            }
        });

        //product tags
        view()->composer(['new_business_profile.manufacturer_products.index','new_business_profile.wholesaler_products.index','new_business_profile.create_rfq_modal','business_profile.show','business_profile._edit_modal_data','wholesaler_profile.products.index','product.details','product.manufactrue_product_details','rfq.create','rfq.create_from_product','rfq._create_rfq_form_modal','rfq._edit_rfq_modal','new_business_profile._product_filter', 'new_business_profile._rfq_filter', 'new_business_profile._rfq_filter_mobile', 'new_business_profile.business_profileinfo_edit._edit_company_overview_modal', 'samples.index'], function($view){
            $product_tags=ProductTag::get(['id','name']);
            $view->with(['product_tags'=>$product_tags]);
        });

        //product type mapping
        view()->composer(['new_business_profile._product_filter','new_business_profile._product_filter_mobile', 'new_business_profile._rfq_filter', 'new_business_profile._rfq_filter_mobile'], function($view){
            $product_type_mapping=ProductTypeMapping::where('parent_id', '!=', null)->get(['id','title']);
            $view->with(['product_type_mapping'=>$product_type_mapping]);
        });

        view()->composer('include.admin._header', function($view) {
            if(auth()->guard('admin')->check()){
                $notifications =auth()->guard('admin')->user()->unreadNotifications->where('read_at',NULL);
                $response = Http::get(env('RFQ_APP_URL').'/api/notifications');
                $messageNotifications = $response->json();
                $view->with(['notifications'=>$notifications,'messageNotifications'=>$messageNotifications]);
            }
        });